#각 날짜별 파이썬 데이터 요약 (검색용)

#-Day01
#이미지 파일 불어오기
#이미지 파일 저장하기
#for문으로 subplot해주기


#-Day02
#이미지 반전(255-원본데이터)
#이미지 밝기 조절
#명암비 조절
#감마 보정
#중간 강조
#이진화
#슬라이스
#등명도선
#명도단계 변환
#중간제거와 중간통과


#-Day03
#덧셈 연산
##같은 크기의 두개의 이미지를 더해서 2로 나누면 두 영상의 평균(썩여서) 나온다
##노이즈가 낀 같은 이미지 값을 다 더해서 평균내면 노이즈가 사라짐
#빼기 연산
##두 영상에서 서로 대응되는 같은 위치의 해 당 화소끼리의 차를 계산하여 구한다
#AND연산(논리곱) 및 OR연산(논리합)

#-Day04
#비트평면분할
#워터마크 삽입
#워터마크 삽입 후 복구
#워터마크가 삽입된 파일을 다시 불러들여서 워터마크를 분해
#jpg파일같이 파일 데이터를 변형 시키는 확장자에서는 작동되지 않아 생각보다 보안에 취약

#-Day05
#필터 함수(경계 처리)
#아이덴티디 필터 (자기자신)
#엠보싱(경계선)
#블러링(필터 사이즈에 대한 블러 효과 정도)
#평균값 필터
#가중 평균값 필터